[
  {
    "image": "https://raw.githubusercontent.com/nicholasxdavis/sai/main/assets/blog_1761784236338_hero.png",
    "title": "Exploring Our Cannabis Scene",
    "description": "A look into Las Cruces’ growing cannabis community — our top dispensary picks, what stands out about each, and what we’re loving right now.",
    "buttonText": "Read More",
    "redirect": "../blogs/exploring_our_cannabis_scene.html",
    "date": "October 29, 2025",
    "photoCredit": "Sav Sewell via Unsplash",
    "contentBlocks": [
      {
        "type": "text",
        "content": "Las Cruces, New Mexico, The desert city with a calm vibe, mountain views, and now, a solid cannabis scene lol. Over the last few years, the industry has expanded fast, and with more dispensaries opening up across town, locals have plenty of choices. At Sunsets and Indicas, we’ve checked out most of them, and these are our current favorites — plus a few strains worth trying if you want the best bang for your buck."
      },
      {
        "type": "image",
        "imageUrl": "https://images.unsplash.com/photo-1746481722096-77aa88762786?ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&q=80&w=1170",
        "altText": "Las Cruces sunset over the Organ Mountains",
        "photoCredit": "Sav Sewell via Unsplash",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "Our Pick #1: Everest Cannabis Co. — Las Cruces North. Address: 4165 White Sage Arc Suite D, Las Cruces, NM 88012. With nearly 4,900 Google reviews, Everest has earned its reputation for clean design, friendly staff, and consistent product quality. Their flower menu stays fresh, and their in-house strains rarely disappoint. We especially recommend their Miracle Alien Cookies — smooth, potent, and perfect for a mellow evening when the desert air cools down."
      },
      {
        "type": "image",
        "imageUrl": "https://everestnm.com/wp-content/uploads/2023/07/Everest-LC-SV.png",
        "altText": "Everest Cannabis Co storefront Las Cruces",
        "photoCredit": "",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "Pick #2: Pecos Valley Production — Locust Street. Address: 2460 S Locust St, Suite 1, Las Cruces, NM 88001. This spot is known for consistency and solid local roots. Their Dairty to Dank lineup always hits right — we’re big fans of the Apple Tartz and Gello strains. They’ve built a reputation for honest pricing and a staff that actually knows what they’re talking about. Whether you’re a casual smoker or seasoned pro, Pecos Valley keeps it professional but laid-back — true to the New Mexico style."
      },
      {
        "type": "image",
        "imageUrl": "https://pecosvalleyproduction.com/wp-content/uploads/2023/12/pecos-valley-production-greathouse-brothers-1-1024x683.jpg",
        "altText": "Pecos Valley Production Las Cruces interior",
        "photoCredit": "",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "Pick #3: Dispensary Near Me — Las Cruces. Address: 1025 El Paseo Rd, Las Cruces, NM 88001. Phone: 575-652-4818. This one doesn’t have the big-brand flash, but they make up for it with prices and reliability. Our personal favorite from here is Pink Runts — easily one of the best-priced, high-quality smokes in Cruces right now. It’s smooth, sweet, and hits just right without breaking the bank. Whether you’re local or passing through, it’s worth checking out their menu; they usually have solid deals running weekly."
      },
      {
        "type": "image",
        "imageUrl": "https://static.wixstatic.com/media/62e6cb_0b76ffa597984dfda6cf4dbdff610485~mv2.png/v1/crop/x_0,y_22,w_1084,h_387/fill/w_207,h_74,al_c,q_85,usm_0.66_1.00_0.01,enc_avif,quality_auto/Blank%202000%20x%20500_edited.png",
        "altText": "Dispensary Near Me Las Cruces exterior",
        "photoCredit": "",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "Runner-Up: Cannaverse — 2305 Nevada Ave, Las Cruces, NM 88001. Cannaverse is a locally owned, veteran-run dispensary that’s been growing quietly but steadily. They bring a community-driven energy that’s refreshing, and their atmosphere feels personal compared to some of the larger chains. While they’re still finding their rhythm in terms of consistency, the potential is there — definitely one to watch as the local market matures."
      },
      {
        "type": "image",
        "imageUrl": "https://lh3.googleusercontent.com/p/AF1QipP2FAFeEKNSUPH0SQ6IHKLcqvoHnyROpkhf29V2=s680-w680-h510-rw",
        "altText": "Cannaverse Las Cruces interior",
        "photoCredit": "",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "Final Thoughts: The cannabis scene in Las Cruces is on the rise, and what’s cool about it is that it still feels local real people, real service, and a community vibe that bigger cities have lost. Whether you’re after budget-friendly buds, top-shelf exotic strains, or something right in the middle, Cruces has you covered. From Everest’s high-end presentation to Pecos Valley’s consistency and Dispensary Near Me’s everyday deals, it’s all part of the city’s growing culture. Stay tuned we’ll keep sharing our picks as new shops open and local growers drop fresh strains worth talking about."
      }
    ]
  },
  {
    "image": "https://raw.githubusercontent.com/nicholasxdavis/sai/main/assets/blog_winter_strains.png",
    "title": "Best Cannabis Strains for Winter ",
    "description": "As the temperatures drop, these strains bring the warmth, relaxation, and creativity you need for winter days and cozy nights.",
    "buttonText": "Read More",
    "redirect": "../blogs/best_cannabis_strains_for_winter_.html",
    "date": "November 3, 2025",
    "photoCredit": "",
    "contentBlocks": [
      {
        "type": "text",
        "content": "Winter is the season for slowing down, warming up, and finding comfort in good smoke. Whether you’re tucked in by a fire, relaxing after work, or just avoiding the cold, the right strain can elevate those moments. These are our top cannabis picks for the winter months — a mix of body-heavy indicas, mood-lifting hybrids, and strains that make long nights feel a little brighter."
      },
      {
        "type": "image",
        "imageUrl": "https://images.squarespace-cdn.com/content/v1/650b04619b2a54218d493ff0/1729029555552-T6XISLO81XJV9F3OUGXA/Northern+Lights+5+Strain.jpg",
        "altText": "Cannabis and hot cocoa on a winter night",
        "photoCredit": "",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "1️⃣ **Northern Lights** — The classic winter strain. This pure indica hits smooth with piney, earthy notes that perfectly fit the cold season. Expect a heavy body high and mental calm — ideal for relaxing indoors while snow (or cold desert wind) hits outside. Great for sleep, pain relief, and turning off your brain after a long day."
      },
      {
        "type": "text",
        "content": "2️⃣ **GMO Cookies (Garlic Cookies)** — Don’t let the funky name fool you — this hybrid’s flavor profile and potency are unmatched. The high is long-lasting and heavy-hitting, perfect for those darker winter evenings when you just want to stay in. The euphoria and body buzz make it a solid choice for late-night movie sessions or just zoning out with good music."
      },
      {
        "type": "image",
        "imageUrl": "https://cdn.shopify.com/s/files/1/2426/0015/files/GMO-cookies-strain-cannabis-flower-nug.jpg?v=1677307149",
        "altText": "Close-up of GMO Cookies cannabis strain",
        "photoCredit": "",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "3️⃣ **White Truffle** — A modern favorite. This strain delivers a clean, balanced high that starts cerebral and melts into deep relaxation. It’s great for creative work, journaling, or just unwinding after a day of cold weather errands. Think of it as your ‘Sunday strain’ for calm focus without burnout."
      },
      {
        "type": "text",
        "content": "4️⃣ **Apple Fritter** — For those who want a little more energy during the winter slump, Apple Fritter keeps you uplifted without the edge. The flavor — sweet, pastry-like, and fruity — fits the cozy holiday vibe. It’s perfect for social nights or weekend sessions when you want to stay functional but elevated."
      },
      {
        "type": "image",
        "imageUrl": "https://leafly-public.imgix.net/strains/photos/ziw0L3SZSIyM6uiLup73_AppleFritter%20(1).jpg",
        "altText": "Apple Fritter cannabis strain with frosty trichomes",
        "photoCredit": "",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "5️⃣ **Purple Punch** — This one’s pure comfort. Heavy, flavorful, and sedating, it’s a top choice for winding down when the nights get long. Sweet grape notes, deep body relaxation, and sleep-friendly effects make it a winter essential — especially for those who struggle with seasonal mood dips or insomnia."
      },
      {
        "type": "text",
        "content": "💭 **Final Thoughts:** Winter isn’t just about hibernation — it’s about slowing down intentionally. The right strain can make those slower moments feel more meaningful, creative, or simply cozy. Whether you’re lighting up Northern Lights to knock out, or rolling a White Truffle joint to think and chill, these strains are the ones we’ll be reaching for until spring hits."
      },
      {
        "type": "image",
        "imageUrl": "https://cannabisnow.com/wp-content/uploads/2014/12/santa-bong.jpg",
        "altText": "Cozy indoor winter scene with cannabis and candlelight",
        "photoCredit": "",
        "file": null,
        "isUrl": true
      }
    ]
  }
]