[
  {
    "image": "https://raw.githubusercontent.com/nicholasxdavis/sai/main/assets/blog_1761784236338_hero.png",
    "title": "Exploring Our Cannabis Scene",
    "description": "A look into Las Cruces’ growing cannabis community — our top dispensary picks, what stands out about each, and what we’re loving right now.",
    "buttonText": "Read More",
    "redirect": "../blogs/exploring_our_cannabis_scene.html",
    "date": "October 29, 2025",
    "photoCredit": "Sav Sewell via Unsplash",
    "contentBlocks": [
      {
        "type": "text",
        "content": "Las Cruces, New Mexico, The desert city with a calm vibe, mountain views, and now, a solid cannabis scene lol. Over the last few years, the industry has expanded fast, and with more dispensaries opening up across town, locals have plenty of choices. At Sunsets and Indicas, we’ve checked out most of them, and these are our current favorites — plus a few strains worth trying if you want the best bang for your buck."
      },
      {
        "type": "image",
        "imageUrl": "https://images.unsplash.com/photo-1746481722096-77aa88762786?ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&q=80&w=1170",
        "altText": "Las Cruces sunset over the Organ Mountains",
        "photoCredit": "Sav Sewell via Unsplash",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "Our Pick #1: Everest Cannabis Co. — Las Cruces North. Address: 4165 White Sage Arc Suite D, Las Cruces, NM 88012. With nearly 4,900 Google reviews, Everest has earned its reputation for clean design, friendly staff, and consistent product quality. Their flower menu stays fresh, and their in-house strains rarely disappoint. We especially recommend their Miracle Alien Cookies — smooth, potent, and perfect for a mellow evening when the desert air cools down."
      },
      {
        "type": "image",
        "imageUrl": "https://everestnm.com/wp-content/uploads/2023/07/Everest-LC-SV.png",
        "altText": "Everest Cannabis Co storefront Las Cruces",
        "photoCredit": "",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "Pick #2: Pecos Valley Production — Locust Street. Address: 2460 S Locust St, Suite 1, Las Cruces, NM 88001. This spot is known for consistency and solid local roots. Their Dairty to Dank lineup always hits right — we’re big fans of the Apple Tartz and Gello strains. They’ve built a reputation for honest pricing and a staff that actually knows what they’re talking about. Whether you’re a casual smoker or seasoned pro, Pecos Valley keeps it professional but laid-back — true to the New Mexico style."
      },
      {
        "type": "image",
        "imageUrl": "https://pecosvalleyproduction.com/wp-content/uploads/2023/12/pecos-valley-production-greathouse-brothers-1-1024x683.jpg",
        "altText": "Pecos Valley Production Las Cruces interior",
        "photoCredit": "",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "Pick #3: Dispensary Near Me — Las Cruces. Address: 1025 El Paseo Rd, Las Cruces, NM 88001. Phone: 575-652-4818. This one doesn’t have the big-brand flash, but they make up for it with prices and reliability. Our personal favorite from here is Pink Runts — easily one of the best-priced, high-quality smokes in Cruces right now. It’s smooth, sweet, and hits just right without breaking the bank. Whether you’re local or passing through, it’s worth checking out their menu; they usually have solid deals running weekly."
      },
      {
        "type": "image",
        "imageUrl": "https://static.wixstatic.com/media/62e6cb_0b76ffa597984dfda6cf4dbdff610485~mv2.png/v1/crop/x_0,y_22,w_1084,h_387/fill/w_207,h_74,al_c,q_85,usm_0.66_1.00_0.01,enc_avif,quality_auto/Blank%202000%20x%20500_edited.png",
        "altText": "Dispensary Near Me Las Cruces exterior",
        "photoCredit": "",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "Runner-Up: Cannaverse — 2305 Nevada Ave, Las Cruces, NM 88001. Cannaverse is a locally owned, veteran-run dispensary that’s been growing quietly but steadily. They bring a community-driven energy that’s refreshing, and their atmosphere feels personal compared to some of the larger chains. While they’re still finding their rhythm in terms of consistency, the potential is there — definitely one to watch as the local market matures."
      },
      {
        "type": "image",
        "imageUrl": "https://lh3.googleusercontent.com/p/AF1QipP2FAFeEKNSUPH0SQ6IHKLcqvoHnyROpkhf29V2=s680-w680-h510-rw",
        "altText": "Cannaverse Las Cruces interior",
        "photoCredit": "",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "Final Thoughts: The cannabis scene in Las Cruces is on the rise, and what’s cool about it is that it still feels local real people, real service, and a community vibe that bigger cities have lost. Whether you’re after budget-friendly buds, top-shelf exotic strains, or something right in the middle, Cruces has you covered. From Everest’s high-end presentation to Pecos Valley’s consistency and Dispensary Near Me’s everyday deals, it’s all part of the city’s growing culture. Stay tuned we’ll keep sharing our picks as new shops open and local growers drop fresh strains worth talking about."
      }
    ]
  },
  {
    "image": "https://raw.githubusercontent.com/nicholasxdavis/sai/main/assets/blog_winter_strains.png",
    "title": "Best Cannabis Strains for Winter",
    "description": "Warm up the cold season with our top cannabis picks — strains that hit perfectly for cozy nights, mellow days, and creative downtime.",
    "buttonText": "Read More",
    "redirect": "../blogs/best_cannabis_strains_for_winter.html",
    "date": "November 3, 2025",
    "photoCredit": "Northern Lights Cannabis Strain",
    "contentBlocks": [
      {
        "type": "text",
        "content": "Winter slows life down, and that’s not a bad thing. It’s the season for relaxation, introspection, and comfort — and the right strain can make those moments even better. Whether you’re snowed in, wrapped in a blanket, or watching the sun dip behind the mountains, these are the best strains to carry you through the cold months."
      },
      {
        "type": "image",
        "imageUrl": "https://images.squarespace-cdn.com/content/v1/650b04619b2a54218d493ff0/1729029555552-T6XISLO81XJV9F3OUGXA/Northern+Lights+5+Strain.jpg",
        "altText": "Northern Lights cannabis strain close-up",
        "photoCredit": "Northern Lights Cannabis Strain",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "1️⃣ **Northern Lights** — The winter classic. A pure indica with pine-heavy, earthy flavor that fits the season perfectly. It delivers deep body relaxation, stress relief, and a calm mental fade that pairs well with quiet nights indoors. If winter had a signature strain, this would be it."
      },
      {
        "type": "image",
        "imageUrl": "https://cdn.shopify.com/s/files/1/2426/0015/files/GMO-cookies-strain-cannabis-flower-nug.jpg?v=1677307149",
        "altText": "GMO Cookies cannabis strain macro shot",
        "photoCredit": "GMO Cookies Cannabis Strain",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "2️⃣ **GMO Cookies (Garlic Cookies)** — Don’t be thrown off by the name. This heavy-hitting hybrid mixes a funky, savory aroma with a long-lasting high that glues you to the couch in the best way possible. Ideal for movie nights or when you just want to stay warm and let the stress melt away."
      },
      {
        "type": "image",
        "imageUrl": "https://biowellnessx.com/wp-content/uploads/2024/04/White-Truffle-x-Cereal-Milk-THCa-Flower-Strain-Elite-BioWellnessX.png.webp",
        "altText": "White Truffle cannabis strain — BioWellnessX",
        "photoCredit": "BioWellnessX",
        "isUrl": true
      },
      {
        "type": "text",
        "content": "3️⃣ **White Truffle** — Sleek, smooth, and balanced. White Truffle hits you first with a light cerebral lift before easing into a full-body calm. It’s great for creative sessions, reflective thinking, or just decompressing without losing focus. A go-to strain for those chilly evenings when you want to feel clear but cozy."
      },
      {
        "type": "image",
        "imageUrl": "https://secretnature.com/cdn/shop/products/white-truffle-thca-529048_600x600_crop_center.jpg?v=1692332789",
        "altText": "Apple Fritter cannabis strain with sugary trichomes",
        "photoCredit": "Apple Fritter Cannabis Strain",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "4️⃣ **Apple Fritter** — Sweet, uplifting, and surprisingly strong. Apple Fritter brings pastry-like flavor and an energetic high that fights off winter fatigue. Perfect for social hangouts, creative bursts, or daytime sessions where you want to stay active but mellow. Think of it as the strain that keeps the winter blues away."
      },
      {
        "type": "image",
        "imageUrl": "https://secretnature.com/cdn/shop/products/purple-punch-thca-489116.png?v=1689349789",
        "altText": "Purple Punch cannabis strain with purple hues",
        "photoCredit": "",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "5️⃣ **Purple Punch** — The ultimate comfort strain. Rich grape and berry flavors, heavy indica effects, and pure sedation. It’s perfect for end-of-day relaxation, fighting insomnia, or simply unwinding in peace. This is the one to roll up when it’s freezing outside and you just want warmth, music, and silence."
      },
      {
        "type": "image",
        "imageUrl": "https://cannabisnow.com/wp-content/uploads/2014/12/santa-bong.jpg",
        "altText": "Santa ",
        "photoCredit": "Santa lol",
        "file": null,
        "isUrl": true
      },
      {
        "type": "text",
        "content": "**Final Thoughts:** Winter is for slowing down and lighting up with intention. These strains don’t just get you high — they fit the mood. From Northern Lights’ classic chill to Purple Punch’s knockout calm, each one has a purpose this season. Keep your stash full, your blanket close, and your lighter ready — because good smoke hits best when it’s cold outside."
      }
    ]
  }
]
